burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
/*!
    \file    gd32m53x_adc.h
    \brief   ADC driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32m53x_adc.h"

#define ADC0_CHANNELX_DATA_REGISTER(ch)             (*((uint32_t *)(uint32_t)(ADC0+0xA0U+((ch)*4U))))
#define ADC2_CHANNELX_DATA_REGISTER(ch)             (*((uint32_t *)(uint32_t)(ADC2+0xA0U+((ch)*4U))))
#define ADC_WDACHCFG_WDACHSEL_MASK                  (uint32_t)(0x0FFF0000U)
#define ADC_WDACHCFG_WDACHMODE_MASK                 (uint32_t)(0x00000FFFU)

/*!
    \brief      reset ADC (API_ID(0x0001U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_deinit(uint32_t adc_periph)
{
    switch(adc_periph) {
    case ADC0:
        rcu_periph_reset_enable(RCU_ADC0RST);
        rcu_periph_reset_disable(RCU_ADC0RST);
        break;
    case ADC2:
        rcu_periph_reset_enable(RCU_ADC2RST);
        rcu_periph_reset_disable(RCU_ADC2RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable ADC interface (API_ID(0x0002U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_enable(uint32_t adc_periph)
{
    if(RESET == (ADC_CTL1(adc_periph) & ADC_CTL1_ADCON)) {
        ADC_CTL1(adc_periph) |= (uint32_t)ADC_CTL1_ADCON;
    }
}

/*!
    \brief      disable ADC interface (API_ID(0x0003U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_disable(uint32_t adc_periph)
{
    ADC_CTL1(adc_periph) &= ~((uint32_t)ADC_CTL1_ADCON);
}

/*!
    \brief      configure ADC data alignment (API_ID(0x0004U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  data_alignment: data alignment select
                only one parameter can be selected which is shown as below:
      \arg        ADC_DATAALIGN_RIGHT: right alignment (LSB)
      \arg        ADC_DATAALIGN_LEFT: left alignment (MSB)
    \param[out] none
    \retval     none
*/
void adc_data_alignment_config(uint32_t adc_periph, uint32_t data_alignment)
{
    if(ADC_DATAALIGN_RIGHT != data_alignment) {
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_DAL;
    } else {
        ADC_CTL0(adc_periph) &= ~((uint32_t)ADC_CTL0_DAL);
    }
}

/*!
    \brief      configure ADC resolution (API_ID(0x0005U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  resolution: ADC resolution
                only one parameter can be selected which is shown as below:
      \arg        ADC_RESOLUTION_12B: 12-bit ADC resolution
      \arg        ADC_RESOLUTION_10B: 10-bit ADC resolution
      \arg        ADC_RESOLUTION_8B: 8-bit ADC resolution
      \arg        ADC_RESOLUTION_6B: 6-bit ADC resolution
    \param[out] none
    \retval     none
*/
void adc_resolution_config(uint32_t adc_periph, uint32_t resolution)
{
    uint32_t  adc_ctl1 = 0U;

    adc_ctl1 = ADC_CTL1(adc_periph);
    adc_ctl1 &= ~((uint32_t)ADC_CTL1_DRES);
    adc_ctl1 |= ((uint32_t)resolution & ADC_CTL1_DRES);

    ADC_CTL1(adc_periph) = adc_ctl1;
}

/*!
    \brief      enable self-diagnosis (API_ID(0x0006U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_self_diagnosis_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_SDSEN;
}

/*!
    \brief      disable self-diagnosis (API_ID(0x0007U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_self_diagnosis_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_SDSEN;
}

/*!
    \brief      config self-diagnosis (API_ID(0x0008U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  mode: self-diagnosis mode select
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELF_DIAGNOSIS_MODE_ROTATION: rotation mode select for self-diagnosis voltage
      \arg        ADC_SELF_DIAGNOSIS_MODE_FIXED: fixed mode select for self-diagnosis voltage
    \param[in]  voltage_select: configure fix voltage for self-diagnosis conversion
                only one parameter can be selected which is shown as below:
      \arg        ADC_SELF_DIAG_0_V: Uses the voltage of 0 V for self-diagnosis
      \arg        ADC_SELF_DIAG_1_2_VREF: Uses the voltage of reference power supply ��1/2 for self-diagnosis
      \arg        ADC_SELF_DIAG_VREF: Uses the voltage of reference power supply for self-diagnosis
    \param[out] none
    \retval     none
*/
void adc_self_diagnosis_mode_config(uint32_t adc_periph, adc_self_diag_mode_enum mode, adc_self_diag_fixed_voltage_enum voltage_select)
{
    uint32_t adc_ctl0 = 0U;

    adc_ctl0 = ADC_CTL0(adc_periph);

    if(ADC_SELF_DIAGNOSIS_MODE_FIXED == mode) {
        adc_ctl0 |= (uint32_t)ADC_CTL0_SDSFIX;
    } else {
        adc_ctl0 &= ~((uint32_t)ADC_CTL0_SDSFIX);
    }

    adc_ctl0 &= ~ADC_CTL0_SDVOG;
    adc_ctl0 |= (uint32_t)(((uint32_t)voltage_select << 12U) & ADC_CTL0_SDVOG);

