burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
    ADC_CTL0(adc_periph) = adc_ctl0;
}

/*!
    \brief      configure disconnection detection assist mode (API_ID(0x0009U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  mode: disconnection detection assist mode select
                only one parameter can be selected which is shown as below:
      \arg        ADC_DISCHARGE_MODE: discharge mode select
      \arg        ADC_PRECHARGE_MODE: precharge mode select
      \arg        ADC_PRECHARGE_DISCHARGE_MODE_DISABLE: disable precharge and discharge mode
    \param[out] none
    \retval     none
*/
void adc_disconnect_detect_mode_config(uint32_t adc_periph, adc_disc_detect_mode_enum mode)
{
    if(mode == ADC_DISCHARGE_MODE) {
        ADC_CTL0(adc_periph) &= ~ADC_CTL0_CHRSEL_MODE;
    } else if(mode == ADC_PRECHARGE_MODE) {
        ADC_CTL0(adc_periph) |= ADC_CTL0_CHRSEL_MODE;
    } else {
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_CHRSEL;
    }
}

/*!
    \brief      configure disconnect detect period (API_ID(0x000AU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  period: disconnect detect period(0x2~0xF), 0x0~0x1 disable precharge and discharge
    \param[out] none
    \retval     none
*/
void adc_disconnect_detect_period_config(uint32_t adc_periph, uint32_t period)
{
    uint32_t  adc_ctl0 = ADC_CTL0(adc_periph);

    adc_ctl0 &= ~ADC_CTL0_CHRSEL_PERIOD;
    adc_ctl0 |= (uint32_t)((period << 4) & ADC_CTL0_CHRSEL_PERIOD);

    ADC_CTL0(adc_periph) = adc_ctl0;
}

/*!
    \brief      enable automatic clearing data registers (API_ID(0x000BU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_data_auto_clear_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |=  ADC_CTL0_ACDATA;
}

/*!
    \brief      disable automatic clearing data registers (API_ID(0x000CU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_data_auto_clear_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_ACDATA;
}

/*!
    \brief      enable automatic setting data registers (API_ID(0x000DU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_data_auto_set_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |=  ADC_CTL0_ASDATA;
}

/*!
    \brief      disable automatic setting data registers (API_ID(0x000EU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_data_auto_set_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_ASDATA;
}

/*!
    \brief      configure ADC sample-and-hold channel (API_ID(0x000FU))
    \param[in]  channel: sample-and-hold channel select
                only one parameter can be selected which is shown as below:
      \arg        ADC_SH_CHANNEL_IN0: use ADC0_IN0 channel-dedicated sample-and-hold circuits
      \arg        ADC_SH_CHANNEL_IN1: use ADC0_IN1 channel-dedicated sample-and-hold circuits
      \arg        ADC_SH_CHANNEL_IN2: use ADC0_IN2 channel-dedicated sample-and-hold circuits
    \param[in]  ctl: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void adc_sample_hold_channel_config(uint32_t channel, ControlStatus ctl)
{
    uint32_t adc_chctl = 0U;

    adc_chctl = ADC_SHCTL;
    if(ENABLE == ctl) {
        adc_chctl |= channel & ADC_SHCTL_SHEN;
    } else {
        adc_chctl &= ~(channel & ADC_SHCTL_SHEN);
    }

    ADC_SHCTL = adc_chctl;
}

/*!
    \brief      configure ADC sample time for sample-and-hold circuits (API_ID(0x0010U))
    \param[in]  sample_time: 0x08~0xFF. The recommended config value should not be less than 8.
    \param[out] none
    \retval     none
*/
void adc_sh_sample_time_config(uint8_t sample_time)
{
    uint32_t adc_shctl = 0U;

    adc_shctl = ADC_SHCTL;

    adc_shctl &= ~ADC_SHCTL_SHSTIME;
    adc_shctl |= (((uint32_t)sample_time << 24) & ADC_SHCTL_SHSTIME);

    ADC_SHCTL = adc_shctl;
}

/*!
    \brief      configure ADC hold time for sample-and-hold circuits (API_ID(0x0011U))
    \param[in]  hold_time: 0x8~0xF. The recommended config value should not be less than 8.
    \param[out] none
    \retval     none
*/
void adc_sh_hold_time_config(uint8_t hold_time)
{
    uint32_t adc_shctl = 0U;

    adc_shctl = ADC_SHCTL;

    adc_shctl &= ~ADC_SHCTL_SHHTIME;
    adc_shctl |= (((uint32_t)hold_time << 20) & ADC_SHCTL_SHHTIME);

    ADC_SHCTL = adc_shctl;
}

/*!
    \brief      enable ADC constant sampling mode for sample-and-hold circuits (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sh_constant_sampling_mode_enable(void)
{
    ADC_SHCTL |= ADC_SHCTL_SHMD;
}

/*!
    \brief      disable ADC constant sampling mode for sample-and-hold circuits (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sh_constant_sampling_mode_disable(void)
{
    ADC_SHCTL &= ~ADC_SHCTL_SHMD;
}

/*!
    \brief      software start sample-and-hold circuit in constant sampling mode (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sh_constant_sampling_start(void)
{
    ADC_SHCTL |= ADC_SHCTL_SHSTART;
}

/*!
    \brief      software end sample-and-hold circuit in constant sampling mode (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sh_constant_sampling_stop(void)
{
    ADC_SHCTL |= ADC_SHCTL_SHEND;
}

/*!
    \brief      enable ADC analog watchdog (API_ID(0x0016U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  window: the selected analog watchdog
                only one parameter can be selected which is shown as below:
      \arg        ADC_WATCHDOG_A: enable analog watchdog A
      \arg        ADC_WATCHDOG_B: enable analog watchdog B
      \arg        ADC_WATCHDOG_A_B:enable analog watchdog A & B
    \param[out] none
    \retval     none
*/
void adc_watchdog_enable(uint32_t adc_periph, adc_watchdog_select_enum window)
{
    switch(window) {
    case ADC_WATCHDOG_A:
        ADC_WDCTL(adc_periph) |= (uint32_t)ADC_WDCTL_WDAEN;
        break;
    case ADC_WATCHDOG_B:
        ADC_WDCTL(adc_periph) |= (uint32_t)ADC_WDCTL_WDBEN;
        break;
    case ADC_WATCHDOG_A_B:
        ADC_WDCTL(adc_periph) |= (uint32_t)ADC_WDCTL_WDAEN | ADC_WDCTL_WDBEN;
        break;
    default :
        break;
    }
}

/*!
    \brief      disable ADC analog watchdog (API_ID(0x0017U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  window: the selected analog watchdog
                only one parameter can be selected which is shown as below:
      \arg        ADC_WATCHDOG_A: enable analog watchdog A
      \arg        ADC_WATCHDOG_B: enable analog watchdog B
      \arg        ADC_WATCHDOG_A_B:enable analog watchdog A & B
    \param[out] none
    \retval     none
*/
void adc_watchdog_disable(uint32_t adc_periph, adc_watchdog_select_enum window)
{
    switch(window) {
    case ADC_WATCHDOG_A:
        ADC_WDCTL(adc_periph) &= ~(uint32_t)ADC_WDCTL_WDAEN;
        break;
    case ADC_WATCHDOG_B:
        ADC_WDCTL(adc_periph) &= ~(uint32_t)ADC_WDCTL_WDBEN;
        break;
    case ADC_WATCHDOG_A_B:
        ADC_WDCTL(adc_periph) &= ~(uint32_t)(ADC_WDCTL_WDAEN | ADC_WDCTL_WDBEN);
        break;
    default :
        break;
    }
}

/*!
    \brief      configure ADC analog watchdog A channel (API_ID(0x0018U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
      \arg        ADC_CHANNEL_ALL: select all channel
    \param[in]  compare_mode: watchdog compare conditions mode
                only one parameter parameter can be selected which is shown as below:
      \arg        ADC_OUT_WINDOW: when the WINEN is 0, WDLT[15:0] value > A/D-converted value. when the WINEN is 1, A/D-converted value < WDLT[15:0] value or WDHT[15:0] < A/D-converted value
      \arg        ADC_IN_WINDOW: when the WINEN is 0, WDLT[15:0] value < A/D-converted value. when the WINEN is 1, WDLT[15:0] value < A/D-converted value < WDHT[15:0] value
    \param[out] none
    \retval     none
*/
void adc_watchdog_a_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, adc_watchdog_compare_condition_enum compare_mode)
{
    if(channel < ADC_CHANNEL_ALL) {
        ADC_WDACHCFG(adc_periph) |= ((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_WDACHCFG_WDACHSEL_MASK);
    } else {
        ADC_WDACHCFG(adc_periph) |= ((uint32_t)0x0FFF0000U);
    }

    if(compare_mode == ADC_OUT_WINDOW) {
        if(channel < ADC_CHANNEL_ALL) {
            ADC_WDACHCFG(adc_periph) &= ~((uint32_t)((uint32_t)0x01U << (channel)) & ADC_WDACHCFG_WDACHMODE_MASK);
        } else {
            ADC_WDACHCFG(adc_periph) &= ~((uint32_t)0x00000FFF);
        }
    } else {
        if(channel < ADC_CHANNEL_ALL) {
            ADC_WDACHCFG(adc_periph) |= (uint32_t)((uint32_t)((uint32_t)0x01U << (channel)) & ADC_WDACHCFG_WDACHMODE_MASK);
        } else {
            ADC_WDACHCFG(adc_periph) |= ((uint32_t)0x00000FFF);
        }
    }
}

/*!
    \brief      deselect ADC analog watchdog A channel (API_ID(0x0019U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
      \arg        ADC_CHANNEL_ALL: select all channel
    \param[out] none
    \retval     none
*/
void adc_watchdog_a_channel_deselect(uint32_t adc_periph, adc_channel_select_enum channel)
{
    if(channel < ADC_CHANNEL_ALL) {
        ADC_WDACHCFG(adc_periph) &= ~((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_WDACHCFG_WDACHSEL_MASK);
    } else {
        ADC_WDACHCFG(adc_periph) &= ~((uint32_t)0x0FFF0000U);
    }
}


/*!
    \brief      configure ADC analog watchdog B channel (API_ID(0x001AU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
    \param[in]  compare_mode: watchdog compare conditions mode
                only one parameter parameter can be selected which is shown as below:
      \arg        ADC_OUT_WINDOW: when the WINEN is 0, WDLT[15:0] value > A/D-converted value. when the WINEN is 1, A/D-converted value < WDLT[15:0] value or WDHT[15:0] < A/D-converted value
      \arg        ADC_IN_WINDOW: when the WINEN is 0, WDLT[15:0] value < A/D-converted value. when the WINEN is 1, WDLT[15:0] value < A/D-converted value < WDHT[15:0] value
    \param[out] none
    \retval     none
*/
void adc_watchdog_b_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, adc_watchdog_compare_condition_enum compare_mode)
{
    uint32_t adc_wdgctl = 0U;

    if(channel < ADC_CHANNEL_ALL) {
        adc_wdgctl = ADC_WDCTL(adc_periph);
        adc_wdgctl &= ~ADC_WDCTL_WDBCHSEL;
        adc_wdgctl |= (uint32_t)(((uint32_t)channel << 28) & ADC_WDCTL_WDBCHSEL);
        ADC_WDCTL(adc_periph) = adc_wdgctl;

        if(compare_mode == ADC_OUT_WINDOW) {
            ADC_WDCTL(adc_periph) &= ~ADC_WDCTL_WDBCM;
        } else {
            ADC_WDCTL(adc_periph) |= ADC_WDCTL_WDBCM;
        }
    }
}

/*!
    \brief      configure ADC analog watchdog A threshold (API_ID(0x001BU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  low_threshold: analog watchdog low threshold, 0x0000..0xFFFF
    \param[in]  high_threshold: analog watchdog high threshold, 0x0000..0xFFFF
    \param[out] none
    \retval     none
*/
void adc_watchdog_a_threshold_config(uint32_t adc_periph, uint16_t low_threshold, uint16_t high_threshold)
{
    uint32_t adc_wdat = 0U;

    adc_wdat = ADC_WDATHOLD(adc_periph);

