burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
    adc_wdat &= ~(ADC_WDATHOLD_WDALT | ADC_WDATHOLD_WDAHT);
    adc_wdat |= (uint32_t)low_threshold | ((uint32_t)high_threshold << 16U);

    ADC_WDATHOLD(adc_periph) = adc_wdat;
}

/*!
    \brief      configure ADC analog watchdog B threshold (API_ID(0x001CU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  low_threshold: analog watchdog low threshold, 0x0000..0xFFFF
    \param[in]  high_threshold: analog watchdog high threshold, 0x0000..0xFFFF
    \param[out] none
    \retval     none
*/
void adc_watchdog_b_threshold_config(uint32_t adc_periph, uint16_t low_threshold, uint16_t high_threshold)
{
    uint32_t adc_wdbt = 0U;

    adc_wdbt = ADC_WDBTHOLD(adc_periph);
    adc_wdbt &= ~(ADC_WDBTHOLD_WDBLT | ADC_WDBTHOLD_WDBHT);
    adc_wdbt |= (uint32_t)low_threshold | ((uint32_t)high_threshold << 16U);

    ADC_WDBTHOLD(adc_periph) = adc_wdbt;
}

/*!
    \brief      enable ADC analog watchdog window function (API_ID(0x001DU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_watchdog_window_mode_enable(uint32_t adc_periph)
{
    ADC_WDCTL(adc_periph) |= ADC_WDCTL_WINEN;
}

/*!
    \brief      disable ADC analog watchdog window function (API_ID(0x001EU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_watchdog_window_mode_disable(uint32_t adc_periph)
{
    ADC_WDCTL(adc_periph) &= ~ADC_WDCTL_WINEN;
}

/*!
    \brief      configure ADC analog watchdog complex conditions (API_ID(0x001FU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  mode: watchdog A/B complex conditions configuration
                one parameter can be selected which is shown as below:
      \arg        ADC_WATCHDOG_MATCH_A_OR_B: (watchdog A condition matched) OR (watchdog B condition matched)
      \arg        ADC_WATCHDOG_MATCH_A_XOR_B: (watchdog A condition matched) XOR (watchdog B condition matched)
      \arg        ADC_WATCHDOG_MATCH_A_AND_B: (watchdog A condition matched) AND (watchdog B condition matched)
    \param[out] none
    \retval     none
*/
void adc_watchdog_complex_condition_config(uint32_t adc_periph, uint32_t mode)
{
    uint32_t  adc_wdgctl = 0U;

    adc_wdgctl = ADC_WDCTL(adc_periph);
    adc_wdgctl &= ~ADC_WDCTL_WDABCC;
    adc_wdgctl |= (ADC_WDCTL_WDABCC & mode);

    ADC_WDCTL(adc_periph) = adc_wdgctl;
}

/*!
    \brief      configure ADC oversample channel (API_ID(0x0020U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
    \param[in]  ratio: ADC oversampling ratio
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_RATIO_MUL_1: oversampling ratio multiple 1
      \arg        ADC_OVERSAMPLING_RATIO_MUL_2: oversampling ratio multiple 2
      \arg        ADC_OVERSAMPLING_RATIO_MUL_3: oversampling ratio multiple 3
      \arg        ADC_OVERSAMPLING_RATIO_MUL_4: oversampling ratio multiple 4
      \arg        ADC_OVERSAMPLING_RATIO_MUL_8: oversampling ratio multiple 8
      \arg        ADC_OVERSAMPLING_RATIO_MUL_16: oversampling ratio multiple 16
      \arg        ADC_OVERSAMPLING_RATIO_MUL_32: oversampling ratio multiple 32
      \arg        ADC_OVERSAMPLING_RATIO_MUL_64: oversampling ratio multiple 64
    \param[out] none
    \retval     none
*/
void adc_oversample_channel_config(uint32_t adc_periph, adc_channel_select_enum channel, uint32_t ratio)
{
    /* configure ADC oversampling ratio */
    if(channel < 8U) {
        ADC_ADDT0(adc_periph) &= ~(ADC_ADDT0_CH0ADDT << (4U * channel));
        ADC_ADDT0(adc_periph) |= (ratio & ADC_ADDT0_CH0ADDT) << (4U * channel);
    } else if(channel < 12U) {
        ADC_ADDT1(adc_periph) &= ~(ADC_ADDT0_CH0ADDT << (4U * (channel - 8U)));
        ADC_ADDT1(adc_periph) |= (ratio & ADC_ADDT0_CH0ADDT) << (4U * (channel - 8U));
    } else {
        /* MISRAC 2004 rule 14.10 */
    }
}

/*!
    \brief      configure ADC oversample mode (API_ID(0x0021U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  mode: A/D conversion data addition mode selection
                only one parameter can be selected which is shown as below:
      \arg        ADC_ACCUMULATION_MODE: accumulation data mode
      \arg        ADC_AVERAGE_MODE: average data mode
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_config(uint32_t adc_periph, adc_oversample_mode_enum mode)
{
    if(ADC_ACCUMULATION_MODE == mode) {
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_ADDSEL;
    } else {
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_ADDSEL;
    }
}

/*!
    \brief      enable ADC oversample mode (API_ID(0x0022U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_ADDEN;
}

/*!
    \brief      disable ADC oversample mode (API_ID(0x0023U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_ADDEN;
}

/*!
    \brief      configure the ADC scan mode (API_ID(0x0024U))
    \param[in]  adc_periph: ADCx(x=0,2)
    \param[in]  scan_mode: ADC scan mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1_SCAN_ONCE: Group_pri1 scan once mode
      \arg        ADC_GROUPS_SCAN: Groups scan mode
      \arg        ADC_GROUP_PRI1_SCAN_CONTINUE: Group_pri1 scan continuous mode
    \param[out] none
    \retval     none
*/
void adc_group_scan_mode_config(uint32_t adc_periph, uint32_t scan_mode)
{
    uint32_t temp_mode = 0U;

    temp_mode = ADC_CTL0(adc_periph);
    temp_mode &= ~((uint32_t)ADC_CTL0_GSCAN);
    temp_mode |= (scan_mode & ADC_CTL0_GSCAN);

    ADC_CTL0(adc_periph) = temp_mode ;
}

/*!
    \brief      enable group priority control (API_ID(0x0025U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_priority_control_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |=  ADC_CTL0_GPRIEN;
}

/*!
    \brief      disable group priority control (API_ID(0x0026U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_priority_control_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_GPRIEN;
}

/*!
    \brief      enable A/D conversion operation for Group_pri3 (API_ID(0x0027U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_pri3_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |=  ADC_CTL0_GP3EN;
}

/*!
    \brief      disable A/D conversion operation for Group_pri3 (API_ID(0x0028U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_pri3_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_GP3EN;
}

/*!
    \brief      enable A/D conversion operation for Group_pri4 (API_ID(0x0029U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_pri4_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |=  ADC_CTL0_GP4EN;
}

/*!
    \brief      disable A/D conversion operation for Group_pri4 (API_ID(0x002AU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_pri4_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_GP4EN;
}

/*!
    \brief      enable lowest-priority group scan continuous (API_ID(0x002BU))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_lowest_priority_continuous_enable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |= ADC_CTL0_LPGCNT;
}

/*!
    \brief      disable lowest-priority group scan continuous (API_ID(0x002CU))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_lowest_priority_continuous_disable(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_LPGCNT;
}

/*!
    \brief      enable low-priority group restart (API_ID(0x002DU))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  restart_ch: rescan channel select
      \arg        ADC_RESTART_ON_BEGINNING: rescan the lower priority group scanning from initial channel
      \arg        ADC_RESTART_ON_BREAKING: rescan the lower priority group scanning from the last aborted channel
    \param[out] none
    \retval     none
*/
void adc_group_restart_enable(uint32_t adc_periph, adc_group_select_enum group, adc_restart_channel_enum restart_ch)
{
    switch(group) {
    case ADC_GROUP_PRI2:
        if(restart_ch == ADC_RESTART_ON_BEGINNING) {
            ADC_GPCGF0(adc_periph) &= (~ADC_GPCGF0_GP2RTCH);
        } else {
            ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_GP2RTCH;
        }
        ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_GP2RTEN;
        break;
    case ADC_GROUP_PRI3:
        if(restart_ch == ADC_RESTART_ON_BEGINNING) {
            ADC_GPCGF1(adc_periph) &= (~ADC_GPCGF1_GP3RTCH);
        } else {
            ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP3RTCH;
        }
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP3RTEN;
        break;
    case ADC_GROUP_PRI4:
        if(restart_ch == ADC_RESTART_ON_BEGINNING) {
            ADC_GPCGF1(adc_periph) &= (~ADC_GPCGF1_GP4RTCH);
        } else {
            ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP4RTCH;
        }
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP4RTEN;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable low-priority group restart (API_ID(0x002EU))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_restart_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI2:
        ADC_GPCGF0(adc_periph) &= (~ADC_GPCGF0_GP2RTEN);
        break;
    case ADC_GROUP_PRI3:
        ADC_GPCGF1(adc_periph) &= (~ADC_GPCGF1_GP3RTEN);
        break;
    case ADC_GROUP_PRI4:
        ADC_GPCGF1(adc_periph) &= (~ADC_GPCGF1_GP4RTEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      select ADC channel for Group_pri x (API_ID(0x002FU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
      \arg        ADC_CHANNEL_ALL: select all channel
    \param[in]  sample_time: 0x02~0xFF. The sample time value 0x02 cycle
    \param[out] none
    \retval     none
*/
void adc_group_channel_config(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel, uint32_t sample_time)
{
    uint8_t i = 0U;
    uint32_t chsel_temp = 0U;
    uint32_t sampr_temp = 0U;

    switch(group) {
    case ADC_GROUP_PRI1:
        if(channel < ADC_CHANNEL_ALL) {
            chsel_temp = ADC_CHSEL0(adc_periph);
            chsel_temp |= ((uint32_t)((uint32_t)0x01U << (channel)) & ADC_CHANNEL_GP1_ALL);
            ADC_CHSEL0(adc_periph) = chsel_temp;
        } else {
            ADC_CHSEL0(adc_periph) |= ((uint32_t)0x00000FFFU);
        }
        break;
    case ADC_GROUP_PRI2:
        if(channel < ADC_CHANNEL_ALL) {
            chsel_temp = ADC_CHSEL0(adc_periph);
            chsel_temp |= ((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_CHANNEL_GP2_ALL);
            ADC_CHSEL0(adc_periph) = chsel_temp;
        } else {
            ADC_CHSEL0(adc_periph) |= ((uint32_t)0x0FFF0000U);
        }
        break;
    case ADC_GROUP_PRI3:
        if(channel < ADC_CHANNEL_ALL) {
            chsel_temp = ADC_CHSEL1(adc_periph);
            chsel_temp |= ((uint32_t)((uint32_t)0x01U << (channel)) & ADC_CHANNEL_GP3_ALL);
            ADC_CHSEL1(adc_periph) = chsel_temp;
        } else {
            ADC_CHSEL1(adc_periph) |= ((uint32_t)0x00000FFFU);
        }
        break;
    case ADC_GROUP_PRI4:
        if(channel < ADC_CHANNEL_ALL) {
            chsel_temp = ADC_CHSEL1(adc_periph);
            chsel_temp |= ((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_CHANNEL_GP4_ALL);
            ADC_CHSEL1(adc_periph) = chsel_temp;
        } else {
            ADC_CHSEL1(adc_periph) |= ((uint32_t)0x0FFF0000U);
        }
        break;
    default:
        break;
    }

    i = channel % 4U;
    if(sample_time < 0x02U) {
        sample_time = 0x02U;
    }
    if(channel < 4U) {
        ADC_SAMPR0(adc_periph) &= ~(uint32_t)(ADC_SAMPR0_SPT00 << (i * 8U));
        ADC_SAMPR0(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else if(channel < 8U) {
        ADC_SAMPR1(adc_periph) &= ~(uint32_t)(ADC_SAMPR1_SPT04 << (i * 8U));
        ADC_SAMPR1(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else if(channel < 12U) {
        ADC_SAMPR2(adc_periph) &= ~(uint32_t)(ADC_SAMPR2_SPT08 << (i * 8U));
        ADC_SAMPR2(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else {
        sampr_temp = ((sample_time) | ((sample_time) << 8U) | ((sample_time) << 16U) | ((sample_time) << 24U));
        ADC_SAMPR0(adc_periph) = sampr_temp;
        ADC_SAMPR1(adc_periph) = sampr_temp;
        ADC_SAMPR2(adc_periph) = sampr_temp;
    }
}

/*!
    \brief      deselect ADC group channel (API_ID(0x0030U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
      \arg        ADC_CHANNEL_ALL: select all channel
    \param[out] none
    \retval     none
*/
void adc_group_channel_deselect(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        if(channel < ADC_CHANNEL_ALL) {
            ADC_CHSEL0(adc_periph) &= ~(uint32_t)((uint32_t)((uint32_t)0x01U << (channel)) & ADC_CHANNEL_GP1_ALL);
        } else {
            ADC_CHSEL0(adc_periph) &= ~((uint32_t)0x00000FFFU);
        }
        break;
    case ADC_GROUP_PRI2:
        if(channel < ADC_CHANNEL_ALL) {
            ADC_CHSEL0(adc_periph) &= ~((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_CHANNEL_GP2_ALL);
        } else {
            ADC_CHSEL0(adc_periph) &= ~((uint32_t)0x0FFF0000U);
        }
        break;
    case ADC_GROUP_PRI3:
        if(channel < ADC_CHANNEL_ALL) {
            ADC_CHSEL1(adc_periph) &= ~(uint32_t)((uint32_t)((uint32_t)0x01U << (channel)) & ADC_CHANNEL_GP3_ALL);
        } else {
            ADC_CHSEL1(adc_periph) &= ~((uint32_t)0x00000FFFU);
        }
        break;
    case ADC_GROUP_PRI4:
        if(channel < ADC_CHANNEL_ALL) {
            ADC_CHSEL1(adc_periph) &= ~((uint32_t)((uint32_t)0x01U << (channel + 16U)) & ADC_CHANNEL_GP4_ALL);
        } else {
            ADC_CHSEL1(adc_periph) &= ~((uint32_t)0x0FFF0000U);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      config end of Group_prix conversion round counts flag (API_ID(0x0031U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  num: end of Group_prix conversion round counts, 0~7
    \param[out] none
    \retval     none
*/
void adc_group_end_flag_round_config(uint32_t adc_periph, adc_group_select_enum group, uint8_t num)
{
    uint32_t  adc_eoc_cr = 0U;

    adc_eoc_cr = ADC_EOCCTL(adc_periph);

    switch(group) {
    case ADC_GROUP_PRI1:
        adc_eoc_cr &= ~ADC_EOCCTL_EOC1RCNT;
        adc_eoc_cr |= (((uint32_t)num << 5U) & ADC_EOCCTL_EOC1RCNT);
        break;
    case ADC_GROUP_PRI2:
        adc_eoc_cr &= ~ADC_EOCCTL_EOC2RCNT;
        adc_eoc_cr |= (((uint32_t)num << 13U) & ADC_EOCCTL_EOC2RCNT);
        break;
    case ADC_GROUP_PRI3:
        adc_eoc_cr &= ~ADC_EOCCTL_EOC3RCNT;
        adc_eoc_cr |= (((uint32_t)num << 21U) & ADC_EOCCTL_EOC3RCNT);
        break;
    case ADC_GROUP_PRI4:
        adc_eoc_cr &= ~ADC_EOCCTL_EOC4RCNT;
        adc_eoc_cr |= (((uint32_t)num << 29U) & ADC_EOCCTL_EOC4RCNT);
        break;
    default :
        break;
    }

    ADC_EOCCTL(adc_periph) = adc_eoc_cr;
}

/*!
    \brief      enable ADC external trigger (API_ID(0x0032U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_external_trigger_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_G1TRGEN;
        break;
    case ADC_GROUP_PRI2:
        ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_G2TRGEN;
        break;
    case ADC_GROUP_PRI3:
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_G3TRGEN;
        break;
    case ADC_GROUP_PRI4:
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_G4TRGEN;
        break;
    default:
        break;
    }
}

/*!
    \brief     config ADC external trigger edge (API_ID(0x0033U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  edge_sel: select trigger edge
                only one parameter can be selected which is shown as below:
      \arg        ADC_EXTERNAL_TRIG_RISING_EDGE: rising edge of external trigger enable
      \arg        ADC_EXTERNAL_TRIG_FAILING_EDGE: falling edge of external trigger enable
      \arg        ADC_EXTERNAL_TRIG_BOTH_EDGE: rising and falling edge of external trigger enable
    \param[out] none
    \retval     none
*/
void adc_group_extern_trigger_edge_config(uint32_t adc_periph, adc_group_select_enum group, uint32_t edge_sel)
{
    uint32_t  adc_trigr0 = 0U, adc_trigr1 = 0U;

    adc_trigr0 = ADC_GPCGF0(adc_periph);
    adc_trigr1 = ADC_GPCGF1(adc_periph);

    switch(group) {
    case ADC_GROUP_PRI1:
        adc_trigr0 &= ~ADC_GPCGF0_GP1TRGED;
        adc_trigr0 |= ((edge_sel << 0U) & ADC_GPCGF0_GP1TRGED);
        ADC_GPCGF0(adc_periph) = adc_trigr0;
        break;
    case ADC_GROUP_PRI2:
        adc_trigr0 &= ~ADC_GPCGF0_GP2TRGED;
        adc_trigr0 |= ((edge_sel << 16U) & ADC_GPCGF0_GP2TRGED);
        ADC_GPCGF0(adc_periph) = adc_trigr0;
        break;
    case ADC_GROUP_PRI3:
        adc_trigr1 &= ~ADC_GPCGF1_GP3TRGED;
        adc_trigr1 |= ((edge_sel << 0U) & ADC_GPCGF1_GP3TRGED);
        ADC_GPCGF1(adc_periph) = adc_trigr1;
        break;
    case ADC_GROUP_PRI4:
        adc_trigr1 &= ~ADC_GPCGF1_GP4TRGED;
        adc_trigr1 |= ((edge_sel << 16U) & ADC_GPCGF1_GP4TRGED);
        ADC_GPCGF1(adc_periph) = adc_trigr1;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable ADC external trigger (API_ID(0x0034U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_external_trigger_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_GPCGF0(adc_periph) &= ~ADC_GPCGF0_G1TRGEN;
        break;
    case ADC_GROUP_PRI2:
        ADC_GPCGF0(adc_periph) &= ~ADC_GPCGF0_G2TRGEN;
        break;
    case ADC_GROUP_PRI3:
        ADC_GPCGF1(adc_periph) &= ~ADC_GPCGF1_G3TRGEN;
        break;
    case ADC_GROUP_PRI4:
        ADC_GPCGF1(adc_periph) &= ~ADC_GPCGF1_G4TRGEN;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable ADC synchronous trigger (API_ID(0x0035U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_synchronous_trigger_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_GPCGF0(adc_periph) &= ~ADC_GPCGF0_GP1TRGTY;
        break;
    case ADC_GROUP_PRI2:
        ADC_GPCGF0(adc_periph) &= ~ADC_GPCGF0_GP2TRGTY;
        break;
    case ADC_GROUP_PRI3:
        ADC_GPCGF1(adc_periph) &= ~ADC_GPCGF1_GP3TRGTY;
        break;
    case ADC_GROUP_PRI4:
        ADC_GPCGF1(adc_periph) &= ~ADC_GPCGF1_GP4TRGTY;
        break;
    default:
        break;
    }
}

