burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
/*!
    \brief      configure ADC synchronous trigger source (API_ID(0x0036U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  external_trigger_source: trigger source
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGOF: TIMER0_TRGOF event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGUF: TIMER0_TRGUF event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGA: TIMER0_TRGA event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGB: TIMER0_TRGB event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGAB: TIMER0_TRGAB event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGAORB: TIMER0_TRGAORB event select (for ADC extend bifurcate trigger source)
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGO: TIMER0_TRGO event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGOF: TIMER7_TRGOF event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGUF: TIMER7_TRGUF event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGA: TIMER7_TRGA event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGB: TIMER7_TRGB event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGAB: TIMER7_TRGAB event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGAORB: TIMER7_TRGAORB event select (for ADC extend bifurcate trigger source)
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGO: TIMER7_TRGO event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER1_TRGO: TIMER1_TRGO event select
      \arg        ADC_SYNCTRIG_SOURCE_TIMER2_TRGO: TIMER2_TRGO event select
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGA: GPTIMER0_TRGA event select
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGB: GPTIMER0_TRGB event select
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGAB: GPTIMER0_TRGAB event select (for ADC extend bifurcate trigger source)
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGA: GPTIMER1_TRGA event select
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGB: GPTIMER1_TRGB event select
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGAB: GPTIMER1_TRGAB event select (for ADC extend bifurcate trigger source)
      \arg        ADC_SYNCTRIG_SOURCE_EVIC_EVSEL0: EVIC_EVSEL0 event select
      \arg        ADC_SYNCTRIG_SOURCE_EVIC_EVSEL1: EVIC_EVSEL1 event select
      \arg        ADC_SYNCTRIG_SOURCE_EVIC_EVSEL0_OR_1: EVIC_EVSEL0 or EVIC_EVSEL1 event select
    \param[out] none
    \retval     none
*/
void adc_group_synchronous_trigger_source_config(uint32_t adc_periph, adc_group_select_enum group, uint32_t external_trigger_source)
{
    uint32_t  adc_trigr0 = 0U, adc_trigr1 = 0U;

    adc_trigr0 = ADC_GPCGF0(adc_periph);
    adc_trigr1 = ADC_GPCGF1(adc_periph);

    switch(group) {
    case ADC_GROUP_PRI1:
        adc_trigr0 &= ~ADC_GPCGF0_GP1TRGSRC;
        adc_trigr0 |= ((external_trigger_source << 2) & ADC_GPCGF0_GP1TRGSRC);
        ADC_GPCGF0(adc_periph) = adc_trigr0;
        break;
    case ADC_GROUP_PRI2:
        adc_trigr0 &= ~ADC_GPCGF0_GP2TRGSRC;
        adc_trigr0 |= ((external_trigger_source << 18) & ADC_GPCGF0_GP2TRGSRC);
        ADC_GPCGF0(adc_periph) = adc_trigr0;
        break;
    case ADC_GROUP_PRI3:
        adc_trigr1 &= ~ADC_GPCGF1_GP3TRGSRC;
        adc_trigr1 |= ((external_trigger_source << 2) & ADC_GPCGF1_GP3TRGSRC);
        ADC_GPCGF1(adc_periph) = adc_trigr1;
        break;
    case ADC_GROUP_PRI4:
        adc_trigr1 &= ~ADC_GPCGF1_GP4TRGSRC;
        adc_trigr1 |= ((external_trigger_source << 18) & ADC_GPCGF1_GP4TRGSRC);
        ADC_GPCGF1(adc_periph) = adc_trigr1;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable ADC asynchronous trigger (API_ID(0x0037U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_asynchronous_trigger_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_GP1TRGTY;
        break;
    case ADC_GROUP_PRI2:
        ADC_GPCGF0(adc_periph) |= ADC_GPCGF0_GP2TRGTY;
        break;
    case ADC_GROUP_PRI3:
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP3TRGTY;
        break;
    case ADC_GROUP_PRI4:
        ADC_GPCGF1(adc_periph) |= ADC_GPCGF1_GP4TRGTY;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable ADC software trigger (API_ID(0x0038U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the channel group class
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_software_trigger_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_EOCCTL(adc_periph) |= ADC_EOCCTL_GP1SWST;
        break;
    case ADC_GROUP_PRI2:
        ADC_EOCCTL(adc_periph) |= ADC_EOCCTL_GP2SWST;
        break;
    case ADC_GROUP_PRI3:
        ADC_EOCCTL(adc_periph) |= ADC_EOCCTL_GP3SWST;
        break;
    case ADC_GROUP_PRI4:
        ADC_EOCCTL(adc_periph) |= ADC_EOCCTL_GP4SWST;
        break;
    default :
        break;
    }
}

/*!
    \brief      software end conversion of all groups (API_ID(0x0039U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     none
*/
void adc_group_software_end_conversion(uint32_t adc_periph)
{
    ADC_CTL0(adc_periph) |= ADC_CTL0_SWEND;
}

/*!
    \brief      enable ADC bifurcate trigger mode for Group_pri x (API_ID(0x003AU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_mode_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    if(group == ADC_GROUP_PRI1) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP1BIMEN;
    } else if(group == ADC_GROUP_PRI2) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP2BIMEN;
    } else if(group == ADC_GROUP_PRI3) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP3BIMEN;
    } else {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP4BIMEN;
    }
}

/*!
    \brief      disable ADC bifurcate trigger mode for Group_pri x (API_ID(0x003BU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_mode_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    if(group == ADC_GROUP_PRI1) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP1BIMEN;
    } else if(group == ADC_GROUP_PRI2) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP2BIMEN;
    } else if(group == ADC_GROUP_PRI3) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP3BIMEN;
    } else {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP4BIMEN;
    }
}

/*!
    \brief      ADC bifurcate trigger channel select (API_ID(0x003CU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_channel_select(uint32_t adc_periph, adc_group_select_enum group, adc_channel_select_enum channel)
{
    uint32_t adc_bifurcate_cr = 0U;

    if(channel < ADC_CHANNEL_ALL) {
        adc_bifurcate_cr = ADC_BITRGCTL(adc_periph);

        if(group == ADC_GROUP_PRI4) {
            adc_bifurcate_cr &= ~ADC_BITRGCTL_GP4BICHSEL;
            adc_bifurcate_cr |= ((((uint32_t)channel) << 27) & ADC_BITRGCTL_GP4BICHSEL);
        } else if(group == ADC_GROUP_PRI3) {
            adc_bifurcate_cr &= ~ADC_BITRGCTL_GP3BICHSEL;
            adc_bifurcate_cr |= ((((uint32_t)channel) << 19) & ADC_BITRGCTL_GP3BICHSEL);
        } else if(group == ADC_GROUP_PRI2) {
            adc_bifurcate_cr &= ~ADC_BITRGCTL_GP2BICHSEL;
            adc_bifurcate_cr |= ((((uint32_t)channel) << 11) & ADC_BITRGCTL_GP2BICHSEL);
        } else {
            adc_bifurcate_cr &= ~ADC_BITRGCTL_GP1BICHSEL;
            adc_bifurcate_cr |= ((((uint32_t)channel) << 3) & ADC_BITRGCTL_GP1BICHSEL);
        }

        ADC_BITRGCTL(adc_periph) = adc_bifurcate_cr;
    }
}

/*!
    \brief      extend bifurcate trigger source select (API_ID(0x003DU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  trigger_source: extend bifurcate trigger source select
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNCTRIG_SOURCE_TIMER0_TRGAORB: select TIMER0_TRGAORB as bifurcate trigger source for ADCx(x=0,2)
      \arg        ADC_SYNCTRIG_SOURCE_TIMER7_TRGAORB: select TIMER7_TRGAORB as bifurcate trigger source for ADCx(x=0,2)
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER0_TRGAB: select GPTIMER0_TRGAB as bifurcate trigger source for ADCx(x=0,2)
      \arg        ADC_SYNCTRIG_SOURCE_GPTIMER1_TRGAB: select GPTIMER1_TRGAB as bifurcate trigger source for ADCx(x=0,2)
      \arg        ADC_SYNCTRIG_SOURCE_EVIC_EVSEL0_OR_1: select EVIC_EVSEL0 or EVIC_EVSEL1 for ADC trigger source for ADCx(x=0,2)
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_extend_trigger_select(uint32_t adc_periph, adc_group_select_enum group, uint32_t trigger_source)
{
    uint32_t adc_trigr = 0U;

