burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
    if(group == ADC_GROUP_PRI1) {
        adc_trigr = ADC_GPCGF0(adc_periph);
        adc_trigr &= ~ADC_GPCGF0_GP1TRGSRC;
        adc_trigr |= ((trigger_source << 2) & ADC_GPCGF0_GP1TRGSRC);
        ADC_GPCGF0(adc_periph) = adc_trigr;
    } else if(group == ADC_GROUP_PRI2) {
        adc_trigr = ADC_GPCGF0(adc_periph);
        adc_trigr &= ~ADC_GPCGF0_GP2TRGSRC;
        adc_trigr |= ((trigger_source << 18) & ADC_GPCGF0_GP2TRGSRC);
        ADC_GPCGF0(adc_periph) = adc_trigr;
    } else if(group == ADC_GROUP_PRI3) {
        adc_trigr = ADC_GPCGF1(adc_periph);
        adc_trigr &= ~ADC_GPCGF1_GP3TRGSRC;
        adc_trigr |= ((trigger_source << 2) & ADC_GPCGF1_GP3TRGSRC);
        ADC_GPCGF1(adc_periph) = adc_trigr;
    } else {
        adc_trigr = ADC_GPCGF1(adc_periph);
        adc_trigr &= ~ADC_GPCGF1_GP4TRGSRC;
        adc_trigr |= ((trigger_source << 18) & ADC_GPCGF1_GP4TRGSRC);
        ADC_GPCGF1(adc_periph) = adc_trigr;
    }
}

/*!
    \brief      enable restore of the next trigger during the current A/D conversion round (API_ID(0x003EU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_trigger_restart_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    if(group == ADC_GROUP_PRI1) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP1BITGRS;
    } else if(group == ADC_GROUP_PRI2) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP2BITGRS;
    } else if(group == ADC_GROUP_PRI3) {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP3BITGRS;
    } else {
        ADC_BITRGCTL(adc_periph) |= ADC_BITRGCTL_GP4BITGRS;
    }
}

/*!
    \brief      disable restore of the next trigger during the current A/D conversion round (API_ID(0x003FU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg          ADC_GROUP_PRI1: select Group_pri1
      \arg          ADC_GROUP_PRI2: select Group_pri2
      \arg          ADC_GROUP_PRI3: select Group_pri3
      \arg          ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_bifurcate_trigger_restart_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    if(group == ADC_GROUP_PRI1) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP1BITGRS;
    } else if(group == ADC_GROUP_PRI2) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP2BITGRS;
    } else if(group == ADC_GROUP_PRI3) {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP3BITGRS;
    } else {
        ADC_BITRGCTL(adc_periph) &= ~ADC_BITRGCTL_GP4BITGRS;
    }
}

/*!
    \brief      enable DMA request (API_ID(0x0040U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_mode_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_DMAEN1;
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_DMAEN2;
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_DMAEN3 ;
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_DMAEN4 ;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable DMA request (API_ID(0x0041U))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_mode_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) &= ~(uint32_t) ADC_DMACTL_DMAEN1;
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) &= ~(uint32_t) ADC_DMACTL_DMAEN2;
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) &= ~(uint32_t) ADC_DMACTL_DMAEN3;
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) &= ~(uint32_t) ADC_DMACTL_DMAEN4;
        break;
    default:
        break;
    }
}

/*!
    \brief      when DMAENx=1, the DMA engine issues request at end of conversion of Group_prix (API_ID(0x0042U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_request_after_last_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP1DDM;
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP2DDM;
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP3DDM;
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP4DDM;
        break;
    default:
        break;
    }
}

/*!
    \brief      the DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x0043U))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_request_after_last_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP1DDM;
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP2DDM;
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP3DDM;
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP4DDM;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable dma overrun detect (API_ID(0x0044U))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_overrun_detect_enable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) |= (uint32_t)(ADC_DMACTL_OVREN1);
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) |= (uint32_t)(ADC_DMACTL_OVREN2);
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) |= (uint32_t)(ADC_DMACTL_OVREN3);
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) |= (uint32_t)(ADC_DMACTL_OVREN4);
        break;
    default:
        break;
    }
}

/*!
    \brief      disable dma overrun detect (API_ID(0x0045U))
    \param[in]  adc_periph: ADCx,x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[out] none
    \retval     none
*/
void adc_group_dma_overrun_detect_disable(uint32_t adc_periph, adc_group_select_enum group)
{
    switch(group) {
    case ADC_GROUP_PRI1:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)(ADC_DMACTL_OVREN1);
        break;
    case ADC_GROUP_PRI2:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)(ADC_DMACTL_OVREN2);
        break;
    case ADC_GROUP_PRI3:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)(ADC_DMACTL_OVREN3);
        break;
    case ADC_GROUP_PRI4:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)(ADC_DMACTL_OVREN4);
        break;
    default:
        break;
    }
}

/*!
    \brief      channel priority config (API_ID(0x0046U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  rank: the priority of the selected channel
                  for ADC0: this parameter must be between 0 to 6.
                  for ADC2: this parameter must be between 0 to 11.
    \param[in]  adc_channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
    \param[out] none
    \retval     none
*/
void adc_channel_priority_config(uint32_t adc_periph, uint8_t rank, adc_channel_select_enum adc_channel)
{
    uint32_t prirx;

    if(adc_channel < ADC_CHANNEL_ALL) {
        if(rank < 8U) {
            prirx = ADC_CHPRI0(adc_periph);
            prirx &= ~((uint32_t)(ADC_CHPRI0_PRI0 << (4U * rank)));
            prirx |= ((uint32_t)adc_channel << (4U * rank));
            ADC_CHPRI0(adc_periph) = prirx;
        } else if(rank < 15U) {
            prirx = ADC_CHPRI1(adc_periph);
            prirx &= ~((uint32_t)(ADC_CHPRI0_PRI0 << (4U * (rank - 8U))));
            prirx |= ((uint32_t)adc_channel << (4U * (rank - 8U)));
            ADC_CHPRI1(adc_periph) = prirx;
        } else {
            /* do nothing */
        }
    }
}

/*!
    \brief      configure ADC channel sample time (API_ID(0x0047U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
      \arg        ADC_CHANNEL_ALL: select all channel
    \param[in]  sample_time: 0x02~0xFF. The sample time value 0x02 cycle.
    \param[out] none
    \retval     none
*/
void adc_channel_sample_time_config(uint32_t adc_periph, adc_channel_select_enum channel, uint32_t sample_time)
{
    uint8_t i = 0U;
    uint32_t sampr_temp = 0U;

    i = channel % 4U;

    if(sample_time < 0x02U) {
        sample_time = 0x02U;
    }

    if(channel < 4U) {
        ADC_SAMPR0(adc_periph) &= ~(uint32_t)(ADC_SAMPR0_SPT00 << (i * 8U));
        ADC_SAMPR0(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else if(channel < 8U) {
        ADC_SAMPR1(adc_periph) &= ~(uint32_t)(ADC_SAMPR1_SPT04 << (i * 8U));
        ADC_SAMPR1(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else if(channel < 12U) {
        ADC_SAMPR2(adc_periph) &= ~(uint32_t)(ADC_SAMPR2_SPT08 << (i * 8U));
        ADC_SAMPR2(adc_periph) |= (uint32_t)((sample_time & ADC_SAMPR0_SPT00) << (i * 8U));
    } else {
        sampr_temp = ((sample_time) | ((sample_time) << 8U) | ((sample_time) << 16U) | ((sample_time) << 24U));
        ADC_SAMPR0(adc_periph) = sampr_temp;
        ADC_SAMPR1(adc_periph) = sampr_temp;
        ADC_SAMPR2(adc_periph) = sampr_temp;
    }
}

/*!
    \brief      select which event as the EVIC link signal (API_ID(0x0048U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  linksignal: EVIC link signal
                only one parameter can be selected which is shown as below:
      \arg          ADC_EVIC_LINK_GROUP_PRI1: an event signal is generated when scanning for Group_pri1 is completed
      \arg          ADC_EVIC_LINK_GROUP_PRI2: an event signal is generated when scanning for Group_pri2 is completed
      \arg          ADC_EVIC_LINK_GROUP_PRI3: an event signal is generated when scanning for Group_pri3 is completed
      \arg          ADC_EVIC_LINK_GROUP_PRI4: an event signal is generated when scanning for Group_pri4 is completed
      \arg          ADC_EVIC_LINK_GROUP_ALL: an event signal is generated when scanning for Group_pri1, Group_pri2, Group_pri3 or Group_pri4 is completed
    \param[out] none
    \retval     none
*/
void adc_evic_link_signal_event_config(uint32_t adc_periph, uint32_t linksignal)
{
    ADC_CTL0(adc_periph) &= ~ADC_CTL0_EVICCTL;
    ADC_CTL0(adc_periph) |= (linksignal & ADC_CTL0_EVICCTL);
}

/*!
    \brief      select EVIC link signal source for Gruop_pri x (API_ID(0x0049U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  signal_src: EVIC trigger signal source
                only one parameter can be selected which is shown as below:
      \arg        ADC_EVIC_LINK_SOURCE_EOCRF_FLAG: EVIC trigger signal selects EOCxRF of Group_prix
      \arg        ADC_EVIC_LINK_SOURCE_EOCF_FLAG: EVIC trigger signal selects EOCxF of Group_prix
    \param[out] none
    \retval     none
*/
void adc_group_evic_link_signal_source(uint32_t adc_periph, adc_group_select_enum group, adc_evic_link_source_enum signal_src)
{
    if(ADC_EVIC_LINK_SOURCE_EOCF_FLAG == signal_src) {
        switch(group) {
        case ADC_GROUP_PRI1:
            ADC_EOCCTL(adc_periph) |=  ADC_EOCCTL_EVICG1SEL;
            break;
        case ADC_GROUP_PRI2:
            ADC_EOCCTL(adc_periph) |=  ADC_EOCCTL_EVICG2SEL;
            break;
        case ADC_GROUP_PRI3:
            ADC_EOCCTL(adc_periph) |=  ADC_EOCCTL_EVICG3SEL;
            break;
        case ADC_GROUP_PRI4:
            ADC_EOCCTL(adc_periph) |=  ADC_EOCCTL_EVICG4SEL;
            break;
        default:
            break;
        }
    } else {
        switch(group) {
        case ADC_GROUP_PRI1:
            ADC_EOCCTL(adc_periph) &=  ~ADC_EOCCTL_EVICG1SEL;
            break;
        case ADC_GROUP_PRI2:
            ADC_EOCCTL(adc_periph) &=  ~ADC_EOCCTL_EVICG2SEL;
            break;
        case ADC_GROUP_PRI3:
            ADC_EOCCTL(adc_periph) &=  ~ADC_EOCCTL_EVICG3SEL;
            break;
        case ADC_GROUP_PRI4:
            ADC_EOCCTL(adc_periph) &=  ~ADC_EOCCTL_EVICG4SEL;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      read ADC channel data register (API_ID(0x004AU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  channel: the selected ADC channel
                only one parameter can be selected which is shown as below:
      \arg        ADC_CHANNEL_INx: select channel ADC_INx, x=0..6 for ADC0, x=0..9 for ADC2
      \arg        ADC_CHANNEL_TEMPERATURE: select temperature sensor channel, for ADC2
      \arg        ADC_CHANNEL_VINT: select internal reference voltage channel, for ADC2
    \param[out] none
    \retval     the conversion value: 0~0xFFFF
*/
uint16_t adc_channel_data_read(uint32_t adc_periph, adc_channel_select_enum channel)
{
    uint16_t data_temp = 0U;

    if(channel < ADC_CHANNEL_ALL) {
        switch(adc_periph) {
        case ADC0:
            data_temp = (uint16_t)(ADC0_CHANNELX_DATA_REGISTER(channel));
            break;
        case ADC2:
            data_temp = (uint16_t)(ADC2_CHANNELX_DATA_REGISTER(channel));
            break;
        default:
            break;
        }
    }

    return data_temp;
}

/*!
    \brief      read ADC self-diagnosis data (API_ID(0x004BU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     the conversion value: 0x0000~0x0FFF (DAL=0,LSB alignment), 0x0000~0xFFF0 (DAL=1,MSB alignment),
*/
uint16_t adc_self_diagnosis_data_read(uint32_t adc_periph)
{
    uint16_t data = 0U;

    if(ADC_CTL0_DAL == (ADC_CTL0_DAL & ADC_CTL0(adc_periph))) {
        /* DAL=1,MSB alignment */
        data = (uint16_t)(ADC_SDDATA(adc_periph) & ((uint32_t)0x0000FFF0));
    } else {
        /* DAL=0,LSB alignment */
        data = (uint16_t)(ADC_SDDATA(adc_periph) & ((uint32_t)0x00000FFF));
    }

