burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
    return data;
}

/*!
    \brief      read ADC self-diagnosis status (API_ID(0x004CU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[out] none
    \retval     voltage status converted by self-diagnosis:
      \arg        0x0: self-diagnosis has never been executed since power-on.
      \arg        0x1: 0V converted by self-diagnosis
      \arg        0x2: VREFP/2 converted by self-diagnosis
      \arg        0x3: VREFP converted by self-diagnosis

*/
uint16_t adc_self_diagnosis_status_read(uint32_t adc_periph)
{
    uint16_t status = 0U;

    if(ADC_CTL0_DAL == (ADC_CTL0_DAL & ADC_CTL0(adc_periph))) {
        /* DAL=1,MSB alignment */
        status = (uint16_t)(ADC_SDDATA(adc_periph) & ((uint32_t)0x00000003));
    } else {
        /* DAL=0,LSB alignment */
        status = (uint16_t)((ADC_SDDATA(adc_periph) & ((uint32_t)0x0000C000)) >> 14U);
    }

    return status;
}

/*!
    \brief      read ADC bifurcate data register (API_ID(0x004DU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  group: select the group
                only one parameter can be selected which is shown as below:
      \arg        ADC_GROUP_PRI1: select Group_pri1
      \arg        ADC_GROUP_PRI2: select Group_pri2
      \arg        ADC_GROUP_PRI3: select Group_pri3
      \arg        ADC_GROUP_PRI4: select Group_pri4
    \param[in]  channel:data channel select
                only one parameter can be selected which is shown as below:
      \arg        ADC_BIFURCATE_DATA: read bifurcate data select
      \arg        ADC_EXTENDED_BIFURCATE_DATA_1: read bifurcate A data
      \arg        ADC_EXTENDED_BIFURCATE_DATA_2: read  bifurcate B data
    \param[out] none
    \retval     the conversion value: 0~0xFFFF
*/
uint16_t adc_bifurcate_data_read(uint32_t adc_periph, adc_group_select_enum group, adc_bifurcate_data_enum channel)
{
    uint16_t data_temp;

    switch(group) {
    case ADC_GROUP_PRI1:
        data_temp = (uint16_t)(*((uint32_t *)(uint32_t)(adc_periph + 0x60U + ((channel) * 4U))));
        break;
    case ADC_GROUP_PRI2:
        data_temp = (uint16_t)(*((uint32_t *)(uint32_t)(adc_periph + 0x60U + 0xCU + ((channel) * 4U))));
        break;
    case ADC_GROUP_PRI3:
        data_temp = (uint16_t)(*((uint32_t *)(uint32_t)(adc_periph + 0x60U + 0x18U + ((channel) * 4U))));
        break;
    case ADC_GROUP_PRI4:
        data_temp = (uint16_t)(*((uint32_t *)(uint32_t)(adc_periph + 0x60U + 0x24U + ((channel) * 4U))));
        break;
    default:
        break;
    }

    return data_temp;
}

/*!
    \brief      get the ADC flag (API_ID(0x004EU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  flag: the ADC flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_EOC1F: end of Group_pri1 conversion flag
      \arg        ADC_FLAG_EOC1RF: end of Group_pri1 conversion flag
      \arg        ADC_FLAG_EOC2F: end of Group_pri2 conversion flag
      \arg        ADC_FLAG_EOC2RF: round end of Group_pri2 conversion flag
      \arg        ADC_FLAG_EOC3F: round end of Group_pri3 conversion flag
      \arg        ADC_FLAG_EOC3RF: round end of Group_pri3 conversion flag
      \arg        ADC_FLAG_EOC4F: end of Group_pri4 conversion flag
      \arg        ADC_FLAG_EOC4RF: end of Group_pri4 conversion flag
      \arg        ADC_FLAG_PROC: A/D conversion is in process state
      \arg        ADC_FLAG_WDAMF: analog watchdog A monitor  event flag
      \arg        ADC_FLAG_WDBMF: analog watchdog B monitor  event flag
      \arg        ADC_FLAG_WDABMF: analog watchdog AB monitor  combine event flag
      \arg        ADC_FLAG_GP1OVRF: dma overrun flag of Group_pri1
      \arg        ADC_FLAG_GP2OVRF: dma overrun flag of Group_pri2
      \arg        ADC_FLAG_GP3OVRF: dma overrun flag of Group_pri3
      \arg        ADC_FLAG_GP4OVRF: dma overrun flag of Group_pri4
      \arg        ADC_FLAG_WDBEF: analog watchdog B event flag
      \arg        ADC_FLAG_WDA_CH0CMPF: channel ADCx_IN0 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH1CMPF: channel ADCx_IN1 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH2CMPF: channel ADCx_IN2 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH3CMPF: channel ADCx_IN3 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH4CMPF: channel ADCx_IN4 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH5CMPF: channel ADCx_IN5 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH6CMPF: channel ADCx_IN6 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH7CMPF: channel ADCx_IN7 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH8CMPF: channel ADCx_IN8 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH9CMPF: channel ADCx_IN9 compare status in watchdog A
      \arg        ADC_FLAG_WDA_TEMPCMPF: temperature sensor channel compare status in watchdog A
      \arg        ADC_FLAG_WDA_VINTCMPF: internal reference voltage channel compare status in watchdog A
      \arg        ADC_FLAG_WDA_ALL_CHCMPF: all channel compare status in watchdog A
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t adc_periph, adc_event_flag_enum flag)
{
    FlagStatus reval = RESET;

    switch(flag) {
    case ADC_FLAG_EOC1F:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC1F) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC1RF:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC1RF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC2F:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC2F) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC2RF:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC2RF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC3F:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC3F) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC3RF:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC3RF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC4F:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC4F) {
            reval = SET;
        }
        break;
    case ADC_FLAG_EOC4RF:
        if(ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC4RF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_PROC:
        if(ADC_CTL0(adc_periph) & ADC_CTL0_PROCF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDAMF:
        if(ADC_WDCTL(adc_periph) & ADC_WDCTL_WDAMF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDBMF:
        if(ADC_WDCTL(adc_periph) & ADC_WDCTL_WDBMF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDABMF:
        if(ADC_WDCTL(adc_periph) & ADC_WDCTL_WDABMF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_GP1OVRF:
        if(ADC_DMACTL(adc_periph) & ADC_DMACTL_GP1OVRF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_GP2OVRF:
        if(ADC_DMACTL(adc_periph) & ADC_DMACTL_GP2OVRF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_GP3OVRF:
        if(ADC_DMACTL(adc_periph) & ADC_DMACTL_GP3OVRF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_GP4OVRF:
        if(ADC_DMACTL(adc_periph) & ADC_DMACTL_GP4OVRF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDBEF:
        if(ADC_WDCTL(adc_periph) & ADC_WDCTL_WDBEF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH0CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH0CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH1CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH1CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH2CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH2CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH3CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH3CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH4CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH4CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH5CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH5CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH6CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH6CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH7CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH7CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH8CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH8CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_CH9CMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_CH9CMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_TEMPCMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_TEMPCMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_VINTCMPF:
        if(ADC_WDACHSTAT(adc_periph) & ADC_WDACHSTAT_VINTCMPF) {
            reval = SET;
        }
        break;
    case ADC_FLAG_WDA_ALL_CHCMPF:
        if(ADC_WDACHSTAT(adc_periph) & ((uint32_t)0x00000FFF)) {
            reval = SET;
        }
        break;
    default:
        break;
    }

    return reval;
}

/*!
    \brief      clear the ADC flag (API_ID(0x004FU))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  flag: the ADC flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_EOC1F: end of Group_pri1 conversion flag
      \arg        ADC_FLAG_EOC1RF: end of Group_pri1 conversion flag
      \arg        ADC_FLAG_EOC2F: end of Group_pri2 conversion flag
      \arg        ADC_FLAG_EOC2RF: round end of Group_pri2 conversion flag
      \arg        ADC_FLAG_EOC3F: round end of Group_pri3 conversion flag
      \arg        ADC_FLAG_EOC3RF: round end of Group_pri3 conversion flag
      \arg        ADC_FLAG_EOC4F: end of Group_pri4 conversion flag
      \arg        ADC_FLAG_EOC4RF: end of Group_pri4 conversion flag
      \arg        ADC_FLAG_PROC: A/D conversion is in process state
      \arg        ADC_FLAG_WDAMF: analog watchdog A monitor  event flag
      \arg        ADC_FLAG_WDBMF: analog watchdog B monitor  event flag
      \arg        ADC_FLAG_WDABMF: analog watchdog AB monitor  combine event flag
      \arg        ADC_FLAG_GP1OVRF: dma overrun flag of Group_pri1
      \arg        ADC_FLAG_GP2OVRF: dma overrun flag of Group_pri2
      \arg        ADC_FLAG_GP3OVRF: dma overrun flag of Group_pri3
      \arg        ADC_FLAG_GP4OVRF: dma overrun flag of Group_pri4
      \arg        ADC_FLAG_WDBEF: analog watchdog B event flag
      \arg        ADC_FLAG_WDA_CH0CMPF: channel ADCx_IN0 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH1CMPF: channel ADCx_IN1 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH2CMPF: channel ADCx_IN2 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH3CMPF: channel ADCx_IN3 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH4CMPF: channel ADCx_IN4 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH5CMPF: channel ADCx_IN5 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH6CMPF: channel ADCx_IN6 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH7CMPF: channel ADCx_IN7 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH8CMPF: channel ADCx_IN8 compare status in watchdog A
      \arg        ADC_FLAG_WDA_CH9CMPF: channel ADCx_IN9 compare status in watchdog A
      \arg        ADC_FLAG_WDA_TEMPCMPF: temperature sensor channel compare status in watchdog A
      \arg        ADC_FLAG_WDA_VINTCMPF: internal reference voltage channel compare status in watchdog A
      \arg        ADC_FLAG_WDA_ALL_CHCMPF: all channel compare status in watchdog A
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t adc_periph, adc_event_flag_enum flag)
{
    switch(flag) {
    case ADC_FLAG_EOC1F:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC1F;
        break;
    case ADC_FLAG_EOC1RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC1RF;
        break;
    case ADC_FLAG_EOC2F:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC2F;
        break;
    case ADC_FLAG_EOC2RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC2RF;
        break;
    case ADC_FLAG_EOC3F:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC3F;
        break;
    case ADC_FLAG_EOC3RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC3RF;
        break;
    case ADC_FLAG_EOC4F:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC4F;
        break;
    case ADC_FLAG_EOC4RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC4RF;
        break;
    case ADC_FLAG_GP1OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP1OVRF;
        break;
    case ADC_FLAG_GP2OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP2OVRF;
        break;
    case ADC_FLAG_GP3OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP3OVRF;
        break;
    case ADC_FLAG_GP4OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP4OVRF;
        break;
    case ADC_FLAG_WDBEF:
        ADC_WDCTL(adc_periph) &= ~ADC_WDCTL_WDBEF;
        break;
    case ADC_FLAG_WDA_CH0CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH0CMPF;
        break;
    case ADC_FLAG_WDA_CH1CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH1CMPF;
        break;
    case ADC_FLAG_WDA_CH2CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH2CMPF;
        break;
    case ADC_FLAG_WDA_CH3CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH3CMPF;
        break;
    case ADC_FLAG_WDA_CH4CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH4CMPF;
        break;
    case ADC_FLAG_WDA_CH5CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH5CMPF;
        break;
    case ADC_FLAG_WDA_CH6CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH6CMPF;
        break;
    case ADC_FLAG_WDA_CH7CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH7CMPF;
        break;
    case ADC_FLAG_WDA_CH8CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH8CMPF;
        break;
    case ADC_FLAG_WDA_CH9CMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_CH9CMPF;
        break;
    case ADC_FLAG_WDA_TEMPCMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_TEMPCMPF;
        break;
    case ADC_FLAG_WDA_VINTCMPF:
        ADC_WDACHSTAT(adc_periph) &= ~ADC_WDACHSTAT_VINTCMPF;
        break;
    case ADC_FLAG_WDA_ALL_CHCMPF:
        ADC_WDACHSTAT(adc_periph) &= ((uint32_t)0xFFFFF000U);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable ADC interrupt (API_ID(0x0050U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  interrupt: the interrupt select
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_EOC1RF: end of Group_pri1 conversion round interrupt
      \arg        ADC_INT_EOC2RF: end of Group_pri2 conversion round interrupt
      \arg        ADC_INT_EOC3RF: end of Group_pri3 conversion round interrupt
      \arg        ADC_INT_EOC4RF: end of Group_pri4 conversion round interrupt
      \arg        ADC_INT_WDA_CHSTAT: analog watchdog A event interrupt
      \arg        ADC_INT_WDBEF: analog watchdog B event interrupt
      \arg        ADC_INT_GP1OVRF: dma overrun interrupt of Group_pri1
      \arg        ADC_INT_GP2OVRF: dma overrun interrupt of Group_pri2
      \arg        ADC_INT_GP3OVRF: dma overrun interrupt of Group_pri3
      \arg        ADC_INT_GP4OVRF: dma overrun interrupt of Group_pri4
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t adc_periph, adc_interrupt_enum interrupt)
{
    switch(interrupt) {
    /* enable high group sequence scan end interrupt */
    case ADC_INT_EOC1RF:
        ADC_EOCCTL(adc_periph) |= (uint32_t)ADC_EOCCTL_EOC1RIE;
        break;
    /* enable mid group sequence scan end interrupt */
    case ADC_INT_EOC2RF:
        ADC_EOCCTL(adc_periph) |= (uint32_t)ADC_EOCCTL_EOC2RIE;
        break;
    /* enable low group sequence scan end interrupt */
    case ADC_INT_EOC3RF:
        ADC_EOCCTL(adc_periph) |= (uint32_t)ADC_EOCCTL_EOC3RIE;
        break;
    /* enable lowest group sequence scan end interrupt */
    case ADC_INT_EOC4RF:
        ADC_EOCCTL(adc_periph) |= (uint32_t)ADC_EOCCTL_EOC4RIE;
        break;
    /* enable analog watchdog A interrupt */
    case ADC_INT_WDA_CHSTAT:
        ADC_WDCTL(adc_periph) |= (uint32_t)ADC_WDCTL_WDAIE;
        break;
    /* enable analog watchdog B interrupt */
    case ADC_INT_WDBEF:
        ADC_WDCTL(adc_periph) |= (uint32_t)ADC_WDCTL_WDBIE;
        break;
    /* enable high group dma overrun interrupt */
    case ADC_INT_GP1OVRF:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP1OVRIE;
        break;
    /* enable mid group dma overrun interrupt */
    case ADC_INT_GP2OVRF:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP2OVRIE;
        break;
    /* enable low group dma overrun interrupt */
    case ADC_INT_GP3OVRF:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP3OVRIE;
        break;
    /* enable lowest group dma overrun interrupt */
    case ADC_INT_GP4OVRF:
        ADC_DMACTL(adc_periph) |= (uint32_t)ADC_DMACTL_GP4OVRIE;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable ADC interrupt (API_ID(0x0051U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  interrupt: the interrupt select
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_EOC1RF: end of Group_pri1 conversion round interrupt
      \arg        ADC_INT_EOC2RF: end of Group_pri2 conversion round interrupt
      \arg        ADC_INT_EOC3RF: end of Group_pri3 conversion round interrupt
      \arg        ADC_INT_EOC4RF: end of Group_pri4 conversion round interrupt
      \arg        ADC_INT_WDA_CHSTAT: analog watchdog A event interrupt
      \arg        ADC_INT_WDBEF: analog watchdog B event interrupt
      \arg        ADC_INT_GP1OVRF: dma overrun interrupt of Group_pri1
      \arg        ADC_INT_GP2OVRF: dma overrun interrupt of Group_pri2
      \arg        ADC_INT_GP3OVRF: dma overrun interrupt of Group_pri3
      \arg        ADC_INT_GP4OVRF: dma overrun interrupt of Group_pri4
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t adc_periph, adc_interrupt_enum interrupt)
{
    switch(interrupt) {
    /* disable high group sequence scan end interrupt */
    case ADC_INT_EOC1RF:
        ADC_EOCCTL(adc_periph) &= ~(uint32_t)ADC_EOCCTL_EOC1RIE;
        break;
    /* disable mid group sequence scan end interrupt */
    case ADC_INT_EOC2RF:
        ADC_EOCCTL(adc_periph) &= ~(uint32_t)ADC_EOCCTL_EOC2RIE;
        break;
    /* disable low group sequence scan end interrupt */
    case ADC_INT_EOC3RF:
        ADC_EOCCTL(adc_periph) &= ~(uint32_t)ADC_EOCCTL_EOC3RIE;
        break;
    /* disable lowest group sequence scan end interrupt */
    case ADC_INT_EOC4RF:
        ADC_EOCCTL(adc_periph) &= ~(uint32_t)ADC_EOCCTL_EOC4RIE;
        break;
    /* disable analog watchdog A interrupt */
    case ADC_INT_WDA_CHSTAT:
        ADC_WDCTL(adc_periph) &= ~(uint32_t)ADC_WDCTL_WDAIE;
        break;
    /* disable analog watchdog B interrupt */
    case ADC_INT_WDBEF:
        ADC_WDCTL(adc_periph) &= ~(uint32_t)ADC_WDCTL_WDBIE;
        break;
    /* disable high group dma overrun interrupt */
    case ADC_INT_GP1OVRF:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP1OVRIE;
        break;
    /* disable low group dma overrun interrupt */
    case ADC_INT_GP3OVRF:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP3OVRIE;
        break;
    /* disable mid group dma overrun interrupt */
    case ADC_INT_GP2OVRF:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP2OVRIE;
        break;
    /* disable low group dma overrun interrupt */
    case ADC_INT_GP4OVRF:
        ADC_DMACTL(adc_periph) &= ~(uint32_t)ADC_DMACTL_GP4OVRIE;
        break;
    default:
        break;
    }
}

/*!
    \brief      get ADC interrupt flag (API_ID(0x0052U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  int_flag: the ADC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_EOC1RF: end of Group_pri1 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC2RF: end of Group_pri2 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC3RF: end of Group_pri3 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC4RF: end of Group_pri4 conversion round interrupt
      \arg        ADC_INT_FLAG_WDA_CHSTAT: analog watchdog A event interrupt
      \arg        ADC_INT_FLAG_WDBEF: analog watchdog B event interrupt
      \arg        ADC_INT_FLAG_GP1OVRF: dma overrun interrupt of Group_pri1
      \arg        ADC_INT_FLAG_GP2OVRF: dma overrun interrupt of Group_pri2
      \arg        ADC_INT_FLAG_GP3OVRF: dma overrun interrupt of Group_pri3
      \arg        ADC_INT_FLAG_GP4OVRF: dma overrun interrupt of Group_pri4
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, adc_interrupt_flag_enum int_flag)
{
    FlagStatus interrupt_flag = RESET;
    uint32_t state;

