burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_adc.c
    /* check the interrupt bits */
    switch(int_flag) {
    case ADC_INT_FLAG_EOC1RF:
        state = ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC1RF;
        if((ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC1RIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EOC2RF:
        state = ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC2RF;
        if((ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC2RIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EOC3RF:
        state = ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC3RF;
        if((ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC3RIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EOC4RF:
        state = ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC4RF;
        if((ADC_EOCCTL(adc_periph) & ADC_EOCCTL_EOC4RIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_WDA_CHSTAT:
        state = (ADC_WDACHSTAT(adc_periph) & ((uint32_t)0x00000FFF));
        if((ADC_WDCTL(adc_periph) & ADC_WDCTL_WDAIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_WDBEF:
        state = ADC_WDCTL(adc_periph) & ADC_WDCTL_WDBEF;
        if((ADC_WDCTL(adc_periph) & ADC_WDCTL_WDBIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_GP4OVRF:
        state = ADC_DMACTL(adc_periph) & ADC_DMACTL_GP4OVRF;
        if((ADC_DMACTL(adc_periph) & ADC_DMACTL_GP4OVRIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_GP3OVRF:
        state = ADC_DMACTL(adc_periph) & ADC_DMACTL_GP3OVRF;
        if((ADC_DMACTL(adc_periph) & ADC_DMACTL_GP3OVRIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_GP2OVRF:
        state = ADC_DMACTL(adc_periph) & ADC_DMACTL_GP2OVRF;
        if((ADC_DMACTL(adc_periph) & ADC_DMACTL_GP2OVRIE) && state) {
            interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_GP1OVRF:
        state = ADC_DMACTL(adc_periph) & ADC_DMACTL_GP1OVRF;
        if((ADC_DMACTL(adc_periph) & ADC_DMACTL_GP1OVRIE) && state) {
            interrupt_flag = SET;
        }
        break;
    default:
        break;
    }
    return interrupt_flag;
}

/*!
    \brief      clear ADC interrupt flag (API_ID(0x0053U))
    \param[in]  adc_periph: ADCx, x=0,2
    \param[in]  int_flag: the ADC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_EOC1RF: end of Group_pri1 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC2RF: end of Group_pri2 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC3RF: end of Group_pri3 conversion round interrupt
      \arg        ADC_INT_FLAG_EOC4RF: end of Group_pri4 conversion round interrupt
      \arg        ADC_INT_FLAG_WDA_CHSTAT: analog watchdog A event interrupt
      \arg        ADC_INT_FLAG_WDBEF: analog watchdog B event interrupt
      \arg        ADC_INT_FLAG_GP1OVRF: dma overrun interrupt of Group_pri1
      \arg        ADC_INT_FLAG_GP2OVRF: dma overrun interrupt of Group_pri2
      \arg        ADC_INT_FLAG_GP3OVRF: dma overrun interrupt of Group_pri3
      \arg        ADC_INT_FLAG_GP4OVRF: dma overrun interrupt of Group_pri4
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, adc_interrupt_flag_enum int_flag)
{
    switch(int_flag) {
    case ADC_INT_FLAG_EOC1RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC1RF;
        break;
    case ADC_INT_FLAG_EOC2RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC2RF;
        break;
    case ADC_INT_FLAG_EOC3RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC3RF;
        break;
    case ADC_INT_FLAG_EOC4RF:
        ADC_EOCCTL(adc_periph) &= ~ADC_EOCCTL_EOC4RF;
        break;
    case ADC_INT_FLAG_WDA_CHSTAT:
        ADC_WDACHSTAT(adc_periph) &= ((uint32_t)0xFFFFF000U);
        break;
    case ADC_INT_FLAG_WDBEF:
        ADC_WDCTL(adc_periph) &= ~ADC_WDCTL_WDBEF;
        break;
    case ADC_INT_FLAG_GP1OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP1OVRF;
        break;
    case ADC_INT_FLAG_GP2OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP2OVRF;
        break;
    case ADC_INT_FLAG_GP3OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP3OVRF;
        break;
    case ADC_INT_FLAG_GP4OVRF:
        ADC_DMACTL(adc_periph) &= ~ADC_DMACTL_GP4OVRF;
        break;
    default:
        break;
    }
}
